In [28]:
import sqlite3
import pandas as pd
import sqlalchemy

In [2]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.26-cp37-cp37m-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
     |████████████████████████████████| 1.6 MB 1.9 MB/s eta 0:00:01     |████████████████████████████▋   | 1.4 MB 1.9 MB/s eta 0:00:01
Collecting greenlet!=0.4.17; python_version >= "3" and (platform_machine == "aarch64" or (platform_machine == "ppc64le" or (platform_machine == "x86_64" or (platform_machine == "amd64" or (platform_machine == "AMD64" or (platform_machine == "win32" or platform_machine == "WIN32"))))))
  Downloading greenlet-1.1.2-cp37-cp37m-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (150 kB)
     |████████████████████████████████| 150 kB 2.6 MB/s eta 0:00:01     |████▍                           | 20 kB 5.1 MB/s eta 0:00:01
Requirement already satisfied: importlib-metadata; python_version < "3.8" in /usr/local/lib/python3.7/site-packages (from sqlalchemy) (2.0.0)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/site-packages (from importlib-metadata; python_version < "3.8"->sqlalchemy) (3.4.0)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.2 sqlalchemy-1.4.26
WARNING: You are using pip version 20.2.4; however, version 21.3.1 is available.
You should consider upgrading via the '/usr/local/bin/python3.7 -m pip install --upgrade pip' command.

In [35]:
connection = sqlite3.connect('OurDataBase2.db')

In [37]:
cursor = connection.cursor()

In [38]:
cursor.execute('CREATE TABLE employees(name TEXT, surname TEXT, salary REAL)')

In [39]:
connection.commit()

In [40]:
engine = sqlalchemy.create_engine('sqlite:///OurDataBase2.db')

In [41]:
pd.read_sql('employees', engine)

Empty DataFrame
Columns: [name, surname, salary]
Index: []

In [42]:
df1 = pd.DataFrame([{'name':'Maxwell', 'surname':'Foster', 'salary':120000.00}])

In [43]:
df1

      name surname    salary
0  Maxwell  Foster  120000.0

In [44]:
df1.to_sql('employees', engine, if_exists='append', index=False)

In [45]:
import yfinance as yf

In [46]:
df = yf.download('GME', start ='2021-01-01')

[*********************100%***********************]  1 of 1 completed

In [47]:
df

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2021-01-04,19.000000,19.100000,17.150000,17.250000,17.250000,10022500
2021-01-05,17.350000,18.080000,17.230000,17.370001,17.370001,4961500
2021-01-06,17.340000,18.980000,17.330000,18.360001,18.360001,6056200
2021-01-07,18.469999,19.450001,18.020000,18.080000,18.080000,6129300
2021-01-08,18.180000,18.299999,17.080000,17.690001,17.690001,6482000
...,...,...,...,...,...,...
2021-10-18,182.940002,189.869995,182.550003,186.020004,186.020004,1589600
2021-10-19,188.990005,192.179993,184.399994,186.789993,186.789993,2070600
2021-10-20,186.330002,188.000000,181.979996,184.520004,184.520004,2276900
2021-10-21,184.710007,190.699997,180.600006,181.710007,181.710007,2402400
2021-10-22,178.100006,179.490005,167.800003,169.800003,169.800003,2797200

In [48]:
df.to_sql('GME', engine)

In [49]:
pd.read_sql('GME', engine)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2021-01-04,19.000000,19.100000,17.150000,17.250000,17.250000,10022500
1,2021-01-05,17.350000,18.080000,17.230000,17.370001,17.370001,4961500
2,2021-01-06,17.340000,18.980000,17.330000,18.360001,18.360001,6056200
3,2021-01-07,18.469999,19.450001,18.020000,18.080000,18.080000,6129300
4,2021-01-08,18.180000,18.299999,17.080000,17.690001,17.690001,6482000
...,...,...,...,...,...,...,...
199,2021-10-18,182.940002,189.869995,182.550003,186.020004,186.020004,1589600
200,2021-10-19,188.990005,192.179993,184.399994,186.789993,186.789993,2070600
201,2021-10-20,186.330002,188.000000,181.979996,184.520004,184.520004,2276900
202,2021-10-21,184.710007,190.699997,180.600006,181.710007,181.710007,2402400
203,2021-10-22,178.100006,179.490005,167.800003,169.800003,169.800003,2797200